Revit 2027 API
BuiltInFailures.StairRampFailures.StairsSupportOverlapFailure Property
 Some supports overlap with others
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StairsSupportOverlapFailure { get; }
Public Shared ReadOnly Property StairsSupportOverlapFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StairsSupportOverlapFailure {
	FailureDefinitionId^ get ();
}
static member StairsSupportOverlapFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace